import { html, render } from 'https://unpkg.com/lit-html?module';
// import { html, render } from "../../node_modules/lit-html/lit-html.js"
import { setCollapsed } from "./../dropDownMenu.js"

let main;

let temp = (dummy) => html `
    <section class="faq-wrapper">
                <section class="top-image">
                    <img src="./images/faq-image.jpg">
                </section>
                <section class="text-boxes">
                    <h2>FAQ - Често Задавани Въпроси</h2>
                    <div id="box-1">
                        <p class="title"><strong>Дигиталните карикатури ръчно ли се рисуват?</strong></p>
                        <p class="description">Да, както пастелните, така и дигиталните карикатури се рисуват ръчно. Разликата е в инструментите, с който се изработват творбите.
    <br>
    За пастелните е необходимо хартия и пастели, а за дигиталните - дигитален таблет и писалка, с която се случва цялата тази магия.</p>
                    </div>    
                    <div id="box-2">
                        <p class="title"><strong>За колко време става изработката на една карикатура?</strong></p>
                        <p class="description">Работим бързо и се съобразяваме изцяло с твоя срок.
Можеш да получиш карикатурата си точно когато ти трябва – дори и за 24 часа.
<br>
Срокът започва да тече от момента, в който потвърдиш описанието и снимките.</p>
                    </div> 
                    <div id="box-3">
                        <p class="title"><strong>Как да изберем подходящи снимки за карикатура?</strong></p>
                        <p class="description">Снимките, които трябва да ни изпратите трябва да са с добро качество, усмихнати, неорязани. Добре е да ни изпратите няколко снимки на лице в близък план, за най-добри резултати.</p>
                    </div>   
                    <div id="box-4">
                        <p class="title"><strong>Какви размери има?</strong></p>
                        <p class="description">30x40 см (A3) или 21х30 см (А4)</p>
                    </div>      
                    <div id="box-5">
                        <p class="title"><strong>Може ли да направите карикатура по моя идея?</strong></p>
                        <p class="description">Карикатурите са персонализиран подарък и могат да бъдат изцяло по Ваша идея.</p>
                    </div>  
                    <div id="box-6">
                        <p class="title"><strong>Ако имам конкретна визия, която съм харесал от Вашият сайт или другаде в интернет?</strong></p>
                        <p class="description">Ако имате конкретна визия, която сте харесали (без значение дали в нашия сайт или другаде в интернет) или някакви конкретни детайли, които искате да ползва художникът, може да изпратите и тях.</p>
                    </div>  
                    <div id="box-7">
                        <p class="title"><strong>Как да поръчам карикатура?</strong></p>
                        <p class="description">Ако желаете да поръчате, моля, изпратете снимки в добро качество на имейл-а ни, също и описание на Вашата идея. Ако имате конкретна визия, която сте харесали (без значение дали в нашият сайт или другаде в интернет) или някакви конкретни детайли, които искате да ползва художника, може да изпратите и тях. Добавете Ваш телефон за връзка и ще се свържем с Вас за потвърждение и уточнения, ако са необходими.</p>
                    </div>  

                </section>
            </section>
`

export function loadFAQView(ctx) {
    main = document.querySelector("main");

    render(temp("dummy"), main);

    setCollapsed(false);
}